app/controllers/images_controller.rb

SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "7"]]
---
  def edit
    @image = Image.find(params[:id])

INSERT INTO "images" ("created_at", "source", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Sat, 02 Aug 2014 12:16:25 UTC +00:00], ["source", nil], ["updated_at", Sat, 02 Aug 2014 12:16:25 UTC +00:00], ["username", "Siddharth"]]
---
  def create
    @image = Image.new(params[:image])
    respond_to do |format|
      if @image.save